Repository: jarulsamy/calicolrc
Catalog: locale/*.po
Languages: es, fr

source: Loading Calico version {0}...
es: Cargando Calico versión {0}...

source: looking for config in "{0}"...
es: buscando por configuración en "{0}"...

source: looking for languages in "{0}"...
es: buscando por lenguajes en "{0}" ...

source: looking for local languages in "{0}"...
es: buscando por lenguajes locales en "{0}" ...

source: Using Mono runtime version {0}
es: Mono versión runtime {0}

source: Calico Project, version {0} on {1}
es: Proyecto Calico, Versión {0} en {1}

source: Start calico with the following options:
es: Inicia Calico con las siguientes opciones:
fr: Démarrer Calico avec les options suivantes:

source: StartCalico Defaults to shell
es: StartCalico Inicia en el Ambiente de Comandos

source: StartCalico FILENAME:LINE ... Edits FILENAMEs, positioned on LINEs
es: StartCalico ARCHIVOs:LINEA ... Edita el/los ARCHIVOs, ubicándose en la LINEA

source: StartCalico --lang=LANGUAGE Sets default language (python, etc.)
es: StartCalico --lang=LENGUAJE Establece el lenguaje por defecto (python, etc)

source: StartCalico --chat Brings up chat window
es: StartCalico --chat Muestra la ventana de Chat

source: StartCalico --exec FILENAMEs Run FILENAMEs standalone with graphics
es: StartCalico --exec ARCHIVOs Ejecuta sólo el/los ARCHIVOs, con gráficos

source: StartCalico --repl FILENAMEs Run FILENAMEs standalone with graphics and then start read-eval loop
es: StartCalico --repl ARCHIVOs Ejecuta sólo el/los ARCHIVOs, con gráficos e inicia un ciclo de lectura-evaluación

source: StartCalico --exec --nographics FILENAMEs Run FILENAMEs standalone without graphics
es: StartCalico --exec --nographics ARCHIVOs Ejecuta sólo el/los ARCHIVOs, sin gráficos

source: StartCalico --repl --nographics FILENAMEs Run FILENAMEs standalone without graphics and then start read-eval loop
es: StartCalico --repl --nographics ARCHIVOs Ejecuta sólo el/los ARCHIVOS, sin gráficos e inicia un ciclo de lectura-evaluación

source: StartCalico --version Displays the version number ({0})
es: StartCalico --version Despliega el número de la versión ({0})

source: StartCalico --reset Resets config settings to factory defaults
es: StartCalico --reset Restaura la configuración a sus valores por defecto

source: StartCalico --help Displays this message
es: StartCalico --help Despliega este mensaje

source: The Calico Project, Version {0}
es: Proyecto Calico, Versión {0}

source: Chat commands: MESSAGE @USER MESSAGE /join CONF /list /create CONF /help
es: Comandos del Chat: MENSAJE @USER MESSAGE /join CONF /list /create CONF /help

source: [Start of previous history]
es: [Comienzo del historial previo]

source: [Start of current history]
es: [Comienzo del historial actual]

source: Go to "{0}" line {1}
es: Ir a "{0}" línea {1}

source: Switch to {0}
es: Cambiar a {0}

source: Exception: {0}
es: Excepción: {0}

source: Value
es: Valor

source: Save this file?
es: ¿Graba este archivo?

source: Save
es: Grabar
fr: Sauvegarder

source: Abandon changes
es: Abandonar cambios

source: Cancel
es: Cancelar
fr: Annuler

source: Select item type
es: Seleccione Lenguaje

source: Create a new item
es: Crear un nuevo script

source: Select the file to open
es: Seleccione el archivo a abrir
fr: Sélectionnez le fichier à ouvrir

source: Open
es: Abrir
fr: Ouvrir

source: Scripting Environment
es: Ambiente de comandos
fr: Environnement de Script

source: Running on {0}
es: Ejecutando en {0}

source: (c) 2011-2013, Institute for Personal Robots in Education
es: (c) 2011-2013, Instituto de Robots Personales en Educación

source: Calico Project
es: Proyecto Calico
fr: Projet Calico

source: Stopping...
es: Deteniendo...

source: Running '{0}'...
es: Ejecutando '{0}' ...

source: Properties
es: Propiedades

source: Error: '{0}' is not an active language
es: Error: '{0}' no es un lenguaje activo

source: [Run file]
es: [Ejecutar Archivo]

source: waiting for confirmation...
es: esperando confirmación...

source: Received messages:
es: Mensajes recibidos:

source: Accept this script?
es: ¿Acepta este script?

source: Accept
es: Aceptar

source: Decline
es: Declinar

source: Blast: Accept '{0}' from '{1}'?
es: Mensaje: Aceptar '{0}' de '{1}'?

source: Blast '{0}' from '{1}' declined.
es: Mensaje '{0}' de '{1}' denegado.

source: No addons are currently available
es: No hay extensiones disponibles

source: Calico Tools
es: Herramientas de Calico

source: Enter the file to save
es: Ingrese el nombre del archivo a grabar
fr: Entrez le fichier à enregistrer

source: for Calico
es: para Calico

source: (c) 2012, Institute for Personal Robots in Education
es: (c) 2012, Instituto de Robots Personales en Educación

source: File
es: Archivo
fr: Fichier

source: New
es: Nuevo

source: Stop Script
es: Detener Script

source: Edit
es: Editar
fr: Editer

source: Save _As...
es: Grabar _Como...

source: Save _As
es: Grabar _Como...

source: _Quit
es: _Salir

source: _Copy
es: _Copiar

source: _Paste
es: _Pegar

source: Cu_t
es: Cor_tar

source: _Undo
es: _Deshacer

source: _Redo
es: _Rehacer

source: Select _All
es: Seleccionar _Todo

source: Indent Region
es: Indentar Región

source: Unindent Region
es: Desindentar Región

source: Comment Region
es: Comentar Región

source: Uncomment Region
es: Descomentar Región

source: Help
es: Ayuda
fr: Aide

source: _About Calico
es: _Acerca de Calico

source: _About
es: _Acerca de

source: Language
es: Lenguaje
fr: Langage

source: Execute Script
es: Ejecutar Script

source: View
es: Ver

source: Options
es: Opciones

source: Zoom _In
es: _Acercar

source: Zoom _Out
es: A_lejar

source: Change _Font...
es: Cambiar _Fuente ...

source: Switch to Shell
es: Cambiar al Shell

source: Select
es: Seleccionar

source: Option 1
es: Opción 1

source: Option 2
es: Opción 2

source: Examples
es: Ejemplos
fr: Exemples

source: Recently opened
es: Abiertos recientemente

source: Recent Scripts
es: Scripts Recientes

source: Tabs
es: Pestañas

source: Show
es: Mostrar

source: Environment Tab
es: Pestaña de Ambiente

source: Locals Tab
es: Pestaña de Contexto Local

source: _Print...
es: _Imprimir...

source: _Print
es: _Imprimir

source: Reset Shell
es: Reiniciar el Shell

source: Clear Output
es: Limpiar Salida

source: Clear Output tab
es: Limpiar Pestaña de Salida

source: Export as Python...
es: Exportar como Python ...

source: Export...
es: Exportar...

source: _Find Next
es: _Buscar el Siguiente

source: _Find
es: _Buscar

source: Use a Module
es: Usar Módulo

source: Getting started...
es: Primeros pasos...

source: Help...
es: Ayuda...

source: What's new...
es: Novedades...

source: Tools
es: Herramientas

source: About
es: Acerca de

source: About...
es: Acerca de...

source: Options...
es: Opciones...

source: Toggle Breakpoint
es: Alternar punto de interrupción

source: Script Options
es: Opciones del Script

source: Find Previous
es: Buscar el Anterior

source: History Tab
es: Pestaña de Historial

source: Register...
es: Registrarse...
fr: S'enregistrer...

source: Login...
es: Iniciar Sesión...
fr: Identifiant...

source: Chat Tab
es: Pestaña de Chat

source: Blast Script...
es: Script de Mensaje...

source: _Normal Size
es: Tamaño _Normal

source: Property Tab
es: Pestaña de Propiedades

source: Addons
es: Extensiones

source: Install New Addon...
es: Instalar Nueva Extensión...

source: Languages
es: Lenguajes

source: Print a script
es: Imprimir un script

source: Create a new script
es: Crear un nuevo script
fr: Creer un nouveau Script

source: Open an existing script
es: Abrir un script existente
fr: Ouvrir un Script existant

source: Save script
es: Grabar el script

source: Zoom in
es: Acercar

source: Zoom out
es: Alejar

source: Make font standard size
es: Fuente a tamaño estándar

source: Show Output in new window
es: Mostrar la Salida en una nueva ventana

source: Vertical Panes
es: Paneles verticales

source: Horizontal Panes
es: Paneles horizontales

source: Stop a running script
es: Detener un script en ejecución

source: Run a script
es: Ejecutar un script

source: Run fast (far-left), Single-step (far-right)
es: Ejecutar rápido (a la izquierda), o paso a paso (a la derecha)

source: Pause a running script
es: Pausar un script en ejecución

source: Continue a paused script
es: Resumir un script pausado

source: Running Script indicator
es: Indicador de Script en Ejecución

source: Find
es: Buscar

source: Text to search for
es: Texto a buscar

source: Find next matching text
es: Buscar siguiente coincidencia

source: Find previous matching text|Find Previous matching text
es: Buscar coincidencia previa|Buscar coincidencia previa

source: Find previous matching text|
es: Buscar coincidencia previa|

source: Close search
es: Cerrar la búsqueda

source: The Calico Project
es: Proyecto Calico

source: Go to Getting Started webpage
es: Ir a la página web de Primeros Pasos

source: Go to Help overview webpage
es: Ir a la página web de Ayuda

source: New...
es: Nuevo...

source: Open...
es: Abrir...

source: Open a recently used script
es: Abrir un script reciente

source: Recently used...
es: Últimos usados...

source: Go to What's new webpage
es: Ir a la página wed de Novedades

source: Home tab
es: Pestaña de Inicio

source: Home
es: Inicio

source: Previous interactive code
es: Código interactivo anterior

source: Next interactive code
es: Código interactivo Siguiente

source: Enter code interactively
es: Introduzca el código de forma interactiva

source: Results of running code
es: Resultados de la ejecución del código

source: Output
es: Salida

source: Variables and their values
es: Variables y sus valores

source: Environment
es: Ambiente

source: Local variables
es: Variables locales

source: Locals
es: Contexto Local

source: Past interactive code
es: Código interactivo pasado

source: History
es: Historial

source: Language:
es: Lenguaje:

source: Status:
es: Estado:

source: offline
es: fuera de línea
fr: Vous n'êtes plus en ligne

source: Email
es: Correo Electrónico

source: Username
es: Usuario
fr: Nom d'utilisateur

source: Password
es: Contraseña
fr: Mot de passe

source: Keyword
es: Palabra Clave

source: Register new user
es: Registrar nuevo usuario

source: Login
es: Iniciar Sesión
fr: Identifiant

source: Find Next
es: Buscar Siguiente

source: Find:
es: Buscar:

source: Statements
es: Instrucciones

source: Input/Output
es: Entrada/Salida

source: Procedures
es: Procedimientos

source: _New
es: _Nuevo

source: _Open
es: _Abrir

source: _Save
es: _Grabar

source: Save the program
es: Grabar el programa

source: when program starts
es: al iniciar el programa

source: Looking for languages in "{0}"...
es: Buscando por lenguajes en "{0}"...

source: Looking for local languages in "{0}"...
es: Buscando por lenguajes locales en "{0}"...

source: StartCalico --verbose Displays detailed information, useful for debugging Calico
es: StartCalico --verbose Muestra información detallada, útil para depurar Calico

source: StartCalico --debug Calico output goes to console rather than GUI
es: StartCalico --debug La salida de Calico va a la consola en lugar de la interfaz gráfica

source: New {0} {1}
es: Nuevo {1} {0}

source: Select Calico Font
es: Seleccione Fuente para Calico

source: Cannot load language file '%s'
fr: Impossible de charger le fichier de langue '%s'

source: unknown file extension: '%s'
fr: Extension de fichier inconnu: '%s'

source: Do you want to run the script?
fr: Voulez-vous exécuter le Script?

source: Do you want to open the script?
fr: Voulez-vous ouvrir le Script?

source: You have received a blast from '%(mfrom)s'. %(q)s
fr: Vous avez reçu un message de '%(mfrom)s'. %(q)s

source: Searching for %r in %s/%s...
fr: Recherche pour %r dans %s/%s...

source: File "%s", line %d, %s"
fr: Fichier "%s", ligne %d, %s"

source: Found %d match%s. Right-click file to open.
fr: Trouvé %d résultat%s. Click droit pour ouvrir le fichier.

source: No matches found.
fr: Aucune correspondance trouvée.

source: Running on %s
fr: Fonctionnant sur %s

source: waiting for confirmation...
fr: en attente de confirmation...

source: received messages:
fr: messages reçus:

source: Calico Login
fr: Identifiant Calico

source: Calico Registration
fr: Inscription Calico

source: Password again
fr: Retaper votre mot de passe

source: Course keyword
fr: Mots-clés" # "keyword" translated but no "Course

source: Register
fr: S'enregistrer

source: Calico Project, Version %s, on %s
fr: Projet Calico, Version %s, de %s

source: calico Defaults to shell
fr: calico Shell par default

source: calico FILENAME:LINE ... Edits FILENAMEs, positioned on LINEs
fr: calico FILENAME:LINE ... Editer FILENAME:LINE

source: calico --shell Brings up shell window
fr: calico --Shell Affiche la fenêtre du Shell

source: calico --editor Brings up editor window
fr: calico --editor Affiche la fenêtre de l'Editeur

source: calico --chat Brings up chat window
fr: calico --chat Affiche la fenêtre du Chat

source: calico --exec FILENAMEs Runs FILENAMEs standalone, with graphics
fr: calico --exec FILENAMEs Exécuter FILENAMEs en mode autonome, avec les graphismes

source: calico --exec --nogui FILENAMEs Runs FILENAMEs standalone, no graphics
fr: calico --exec --nogui FILENAMEs Exécuter FILENAMEs en mode autonome, sans graphismes

source: calico --version Displays the version number (%s)
fr: calico --version Affiche le numéro de version (%s)

source: calico --help Displays this message
fr: calico --help Affiche ce message

source: calico --debug Puts Calico in debugging mode
fr: calico --debug Met Calico en mode débogage

source: Open Script...
fr: Ouvrir Script

source: Close
fr: Fermer

source: Quit
fr: Sortir

source: Copy
fr: Copier

source: Paste
fr: Coller

source: Cut
fr: Couper

source: Select all
fr: Tous sélectionnez

source: Windows
fr: Fenêtres

source: Editor
fr: Editeur

source: Make font larger
fr: Faire une police plus grande

source: Make font smaller
fr: Faire une police plus petite

source: About the Calico Project
fr: Au sujet du projet Calico

source: Status
fr: Etat

source: Send
fr: Envoyer

source: Calico Chat Window
fr: Fenêtre de Chat Calico

source: Enter /help for details
fr: Tapez /help (aide) pour plus de détails

source: Chat commands: MESSGE - send a message to all in conference @USER MESSAGE - send a message to USER /join CONF - join a conference /list - list conferences /create CONF - create conference /help - this help message
fr: Commandes du Chat: MESSGE - envoyer un message à tous en conférence @USER MESSAGE - envoyer un message à USER /join CONF - rejoindre une conférence /list - lister les conférences /create CONF - créer une conférence /help - ce message d'aide

source: You are not currently online
fr: Vous n'êtes pas en ligne actuellement

source: You need to login first
fr: Vous devez d'abord ouvrir une session

source: New %s Script
fr: Nouveau Script %s

source: Calico Editor - %s
fr: Editeur Calico - %s

source: Save...
fr: Enregistrer...

source: Save as...
fr: Enregistrer en tant que...

source: Search...
fr: Recherche...

source: Find next
fr: Trouver suivant

source: Find previous
fr: Trouver précédent

source: Run
fr: Exécuter

source: Reset and run
fr: Réinitialiser et exécuter

source: Blast...
fr: Messages...

source: Save current script
fr: Enregistrer le Script actuel

source: Run script
fr: Exécuter le Script

source: Calico Editor
fr: Editeur Calico

source: Calico Script Blast
fr: Messages de Script Calico

source: To
fr: A

source: Open script in their editor
fr: Ouvrir le Script dans l'éditeur

source: Run script on their computer
fr: Exécuter le Script sur le PC

source: Blast!
fr: Envoyer!

source: online
fr: en ligne

source: You are not online
fr: Vous n'êtes pas connecter

source: You need to login
fr: Vous devez vous identifier

source: considering 1:
fr: considération 1:

source: considering 2:
fr: considération 2:

source: Class:
fr: Classe:

source: Method:
fr: Méthode:

source: Loading file '%s'...
fr: Chargement du fichier '%s'...

source: Done loading file.
fr: Fin du chargement du fichier.

source: Search in files...
fr: Rechercher dans les fichiers...

source: Stop script
fr: Stopper le Script

source: Swap script and history areas
fr: Echanger Script et historique

source: Calico Project %s
fr: Projet Calico %s

source: Change to %s
fr: Changer pour %s

source: Clear
fr: Nettoyer

source: Restart shell
fr: Redémarrer le Shell

source: Possible completions:
fr: Complétions possibles:

source: No completions found for '%s'
fr: Pas de complétions trouvée pour '%s'

source: Stopping...
fr: Arrêt...

source: Reset shell
fr: Réinitialiser le Shell

source: Get help on error
fr: Obtenez de l'aide en cas d'erreur

source: File "(.*)", line (\d*)
fr: Fichier "(.*)", ligne (\d*)

source: Edit %s
fr: Editer %s

source: This voice provides an American English male ...
fr: Cette voix correspond à celle d'un homme Englais Américain...

source: For each variable below, fill in a value:
fr: Pour chaque variable ci-dessous, remplissez-là d'une valeur:

source: Which story?
fr: Numéro

source: Try #%d: Guess a number between 1 and %d
fr: Essai #%d: Devinez un nombre entre 1 et %d

source: On try number %d you guessed %d and that is too low.
fr: Essai %d vous avez deviné %d et cette valeur est trop basse.

source: On try number %d you guessed %d and that is too high.
fr: Essai %d vous avez deviné %d et cette valeur est trop haute.

source: Sorry, but you didn't guess it in %d tries. My number was %d.
fr: Désolé, mais vous n'avez pas deviner aprés %d essais. Mon numéro était le %d.

source: You guessed my secret number in %d tries! It was %d.
fr: Vous avez deviné mon numéro secret en %d essais! C'était bien le %d.

source: Select a file
fr: Sélectionnez un fichier

source: You are now logged in as '%s'.
fr: Vous êtes maintenant connecté en tant que '%s'.

source: rejected
fr: rejeté

source: You were not allowed to log in.
fr: Vous n'étes pas autorisé à vous connecter.

source: Please check your ID and password.
fr: S'il vous plaît vérifiez votre identifiant et votre mot de passe.

source: Search:
fr: Recherche:

source: Search in files:
fr: Recherche dans les fichiers:

source: Recent files
fr: Fichiers récents
